### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [7]:
S=pd.Series(data=(4,8,15,16,23,42))
S

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
### variable print it.

In [3]:
l=[1,2,3,4,5,6,7,8,9,10]
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:
### Then, print the DataFrame.
    Name
    Alice
    Bob
    Claire

    Age
    25
    30
    27

    Gender
    Female
    Male
    Female

In [10]:
data={"Name":["Alice","Bob","Claire"],
     "Age":[25,30,27],
     "Gender":["Female","Male","Female"]}
D=pd.DataFrame(data)
D

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [11]:
# Dataframe is collection/structured form of data organized in row and columns 
# Series is equivalent to list where list does not show index but data series does

data={"Name":["Alice","Bob","Claire"],
     "Age":[25,30,27],
     "Gender":["Female","Male","Female"]}
D=pd.DataFrame(data)
D

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
type(D)

pandas.core.frame.DataFrame

In [14]:
s=D['Name']
s

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [15]:
type(s)

pandas.core.series.Series

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
### you give an example of when you might use one of these functions?

In [ ]:
# Dataframe has some functions like
# groupby()
# mean()
# apply()

In [37]:
l= pd.read_csv('titanic.csv')
l.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [44]:
l.groupby('Survived').mean()

/tmp/ipykernel_77/4133663478.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  l.groupby('Survived').mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [45]:
l.mean()

/tmp/ipykernel_77/1582725611.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  l.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [46]:
def inr(x):
    return x*80

l['new_col']=l['Fare'].apply(inr)

In [47]:
l

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,580.000
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,5702.664
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,634.000
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4248.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,644.000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1040.000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2400.000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1876.000
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2400.000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,620.000

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [48]:
# Series
    #Homogeneous data
    #Size Immutable –size cannot be changed
    #Values of Data Mutable
# Dataframe
    #Heterogeneous data
    #Size Mutable
    #Data Mutable
# Panel
    #Heterogeneous data
    #Size Mutable
    #Data Mutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [51]:
s1 = pd.Series(data=[1,2,3,4,5,6,7])
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [52]:
s2=pd.Series(data=["a","b","c","d","e","f","g"])
s2

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [55]:
d=pd.concat([s1,s2],axis=1)

In [56]:
d

   0  1
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e
5  6  f
6  7  g